courses/tech/Rust/Rust.org
#+TITLE: Programski jezik Rust
#+SUBTITLE: Bazirano na verziji 1.58.1. U izradi.
#+EXPORT_FILE_NAME: index.html
#+SETUPFILE: ../../courses-startup.org

* Uvod
- Jezik opšte namene, kompajliran i statički tipiziran sa inferencom tipova
- Sistemsko programiranje ali sa osobinama višeg nivoa apstrakcije kao što su
  funkcionalno programiranje
- 2010, Graydon Hoare, Mozilla Research
- Performanse i sigurnost
- Ne koristi /garbage collector/ ali obezbeđuje memorijsku sigurnost kroz /borrow
  checker/
- Sintaksno sličan C++. Uticaj i OCaml-a, Haskell-a i Erlang-a.
- Koristi se u velikim firmama: Amazon, Facebook, Google, Microsoft...
- Od 2016 godine na SO upitniku konstantno prvi u kategoriji /"most loved
  programming languages"/
* Instalacija i podešavanje
** Instalacija
- Rust stiže sa alatom za upravljanje lanca alata =rustup=

#+begin_src sh
$ curl --proto '=https' --tlsv1.2 https://sh.rustup.rs -sSf | sh
#+end_src

- Provera instalacije

#+begin_src sh
~> rustc --version
rustc 1.58.1 (db9d1b20b 2022-01-20)
#+end_src

** Pregled instalacije
#+begin_src sh
~> rustup show
Default host: x86_64-unknown-linux-gnu
rustup home:  /home/igor/.rustup

installed toolchains
--------------------

stable-x86_64-unknown-linux-gnu (default)
nightly-x86_64-unknown-linux-gnu

active toolchain
----------------

stable-x86_64-unknown-linux-gnu (default)
rustc 1.58.1 (db9d1b20b 2022-01-20)
#+end_src

** Ažuriranje
Za ažuriranje instalacije na najnoviju verziju

#+begin_src sh
rustup update
#+end_src

** Dokumentacija

Rust stiže sa veoma dobrom dokumentacijom i knjigama koje su dostupne direktno
iz instalacije.

#+begin_src sh
rustup doc
#+end_src

* Početak
** Hello, World!

#+begin_src sh
$ mkdir hello_world
$ cd hello_world
#+end_src

File =main.rs=:
#+begin_src rust
fn main() {
    println!("Hello, world!");
}
#+end_src

** Kompajliranje i pokretanje

#+begin_src sh
$ rustc main.rs
$ ./main
Hello, world!
#+end_src
** Hello, Cargo!
- Alat za razrešavanje zavisnosti i upravljanje projektom.

#+begin_src sh
~> cargo --version
cargo 1.58.0 (f01b232bc 2022-01-19)
#+end_src

- Kreiranje projekta sa =cargo= alatom:

#+begin_src sh
$ cargo new hello_cargo
$ cd hello_cargo
#+end_src

** Sadržaj kreiranog projekta
Fajl =cargo.toml= čuva konfiguraciju projekta. Format je [[https://toml.io/en/][TOML]] (/Tom’s Obvious,
Minimal Language/):

#+begin_src toml
[package]
name = "hello_cargo"
version = "0.1.0"
edition = "2021"

[dependencies]
#+end_src

Fajl =src/main.rs=:
#+begin_src rust
fn main() {
    println!("Hello, world!");
}
#+end_src
** Pokretanje

#+begin_src rust
$ cargo build
   Compiling hello_cargo v0.1.0 (file:///projects/hello_cargo)
    Finished dev [unoptimized + debuginfo] target(s) in 2.85 secs
#+end_src

Izvršni fajl se može naći na lokaciji =target/debug/hello_cargo=:

#+begin_src sh
$ ./target/debug/hello_cargo
Hello, world!
#+end_src

Ali =cargo= omgućava i jednostavniji način pokretanja:
#+begin_src sh
$ cargo run
    Finished dev [unoptimized + debuginfo] target(s) in 0.0 secs
     Running `target/debug/hello_cargo`
Hello, world!
#+end_src

** Provera
Takođe je moguće brzo proveriti da li se kod kompajlira:

#+begin_src sh
$ cargo check
   Checking hello_cargo v0.1.0 (file:///projects/hello_cargo)
    Finished dev [unoptimized + debuginfo] target(s) in 0.32 secs
#+end_src

** Izgradnja finalne verzije
- U toku razvoja koristimo izgradnju za degabovanje koja se brže završi ali je
  izvršni kod neoptimalan.

- Za finalnu verziju je potrebno izgradnju obaviti na sledeći način:

    #+begin_src rust
    cargo build --release
    #+end_src

- Ovo će obaviti dodatne optimizacije koje će duže trajati ali će krajnji kod
  biti optimizovan.

** Cargo kao konvencija

Praktično svi Rust projekti koriste Cargo tako da je unifikovan način izgradnje
projekata. Uglavnom se svodi na:

#+begin_src sh
$ git clone example.org/someproject
$ cd someproject
$ cargo build
#+end_src

* Igra pogađanja brojeva
** Podešavanje projekta
#+begin_src rust
$ cargo new guessing_game
$ cd guessing_game
#+end_src

Fajl =Cargo.toml=:
#+begin_src toml
[package]
name = "guessing_game"
version = "0.1.0"
edition = "2021"

[dependencies]
#+end_src

Fajl =src/main.rs=:
#+begin_src rust
fn main() {
    println!("Hello, world!");
}
#+end_src

#+REVEAL: split

#+begin_src sh
$ cargo run
   Compiling guessing_game v0.1.0 (file:///projects/guessing_game)
    Finished dev [unoptimized + debuginfo] target(s) in 1.50s
     Running `target/debug/guessing_game`
Hello, world!
#+end_src

** Preuzimanje broja sa standardnog ulaza

#+begin_src rust
use std::io;

fn main() {
    println!("Guess the number!");

    println!("Please input your guess.");

    let mut guess = String::new();

    io::stdin()
        .read_line(&mut guess)
        .expect("Failed to read line");

    println!("You guessed: {}", guess);
}
#+end_src

** Izmenjivost (/mutability/)

- Varijable su podrazumevano neizmenjive (/immutable/).
- Ukoliko želimo varijablu čija vrednost može da se menja koristimo ključnu reč
  =mut=.

  #+begin_src rust
  let apples = 5; // immutable
  let mut bananas = 5; // mutable
  #+end_src

- Isto važi i za parametre funkcija:

  #+begin_src rust
  io::stdin()
      .read_line(&mut guess)
  #+end_src

